app/controllers/nokia_workouts_controller.rb

  def index
    @nokia_workouts = NokiaWorkout.all
---
SELECT * FROM `nokia_workouts`

  def show
    @nokia_workout = NokiaWorkout.find(params[:id])
---
SELECT * FROM `nokia_workouts` WHERE (`nokia_workouts`.`id` = 1)

  def create
    @nokia_workout = NokiaWorkout.new(params[:nokia_workout])

    respond_to do |format|
      if @nokia_workout.save
---
INSERT INTO `nokia_workouts` (`verticalmovement_maxaltitude`, `created_at`, `realtime`, `speed_max`, `updated_at`, `file_content_type`, `file_file_size`, `pace_max`, `verticalmovement_descent`, `activity_oid`, `file_file_name`, `speed_average`, `version`, `pace_average`, `verticalmovement_minaltitude`, `features`, `starttime`, `stoptime`, `totaltime`, `verticalmovement_ascent`, `activity_name`, `oid`, `distance`) VALUES(NULL, '2009-12-09 18:08:00', '2009-12-09 18:06:00', NULL, '2009-12-09 18:08:00', 'text/xml', 965993, '2009-12-09 18:06:00', NULL, NULL, 'W20091119195152.xml', NULL, NULL, '2009-12-09 18:06:00', NULL, NULL, '2009-12-09 18:06:00', '2009-12-09 18:06:00', '2009-12-09 18:06:00', NULL, '', NULL, NULL)