app/controllers/trainings_controller.rb

  def index
    @user_id = params[:user_id] || current_user.id
    @page = params[:page] || 1
    @per_page = params[:limit] || 10
    @conditions = {:workouts => {
      :user_id => @user_id
    }}
    @training = Training.paginate :include => [:workout],
        :conditions => @conditions,
        :page => params[:page],:per_page => @per_page
---
SELECT * FROM `trainings`

  def show
    @training = Training.find(params[:id])
---
SELECT * FROM `trainings` WHERE (`trainings`.`id` = 3)

  def edit
    @training = Training.find(params[:id])
---
SELECT * FROM `trainings` WHERE (`trainings`.`id` = 18)

  def create
    @training = Training.new(params[:training])

    respond_to do |format|
      if @training.save
---
INSERT INTO `trainings` (`finish`, `created_at`, `health_frequency`, `effort`, `updated_at`, `exercise_id`, `start`, `workout_id`, `distance`) VALUES('2009-10-31 11:30:00', '2009-10-31 11:30:49', 155, 1, '2009-10-31 11:30:49', 1, '2009-10-31 11:30:00', 21, NULL)