app/controllers/types_of_exercises_controller.rb

  def index
    @types_of_exercises = TypesOfExercise.all
---
SELECT * FROM `types_of_exercises`

  def show
    @types_of_exercise = TypesOfExercise.find(params[:id])
---
SELECT * FROM `types_of_exercises` WHERE (`types_of_exercises`.`id` = 1)

  def create
    @types_of_exercise = TypesOfExercise.new(params[:types_of_exercise])

    respond_to do |format|
      if @types_of_exercise.save
---
INSERT INTO `types_of_exercises` (`name`, `created_at`, `updated_at`) VALUES('Aeróbico', '2009-10-30 20:41:26', '2009-10-30 20:41:26')