app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    @user.save do |result|
---
INSERT INTO `users` (`name`, `single_access_token`, `last_request_at`, `created_at`, `crypted_password`, `perishable_token`, `updated_at`, `failed_login_count`, `current_login_ip`, `openid_identifier`, `password_salt`, `current_login_at`, `persistence_token`, `login_count`, `last_login_ip`, `login`, `last_login_at`, `email`) VALUES(NULL, 'RgrnYs_UFs06D2PH5VOm', '2009-09-07 22:32:55', '2009-09-07 22:32:55', '0de48be819072b575f6b65ffbe103f8f395e7923eb733b840a5a70459bee8610237fd15ba4563b08fe8d60498b4e13d19a19141576829dd4bedfd71806855f7a', 'RH_NfHRNGUpnV2KClNsA', '2009-09-07 22:32:55', 0, '127.0.0.1', 'http://www.milfont.org/tech', 'AJ-QWxmgwIIgr8gRBcLS', '2009-09-07 22:32:55', '083a0f2da6f33594af8b22077dd31f8f8c36c80d27e71c6610f342b8320115a1b11906e1f508244dd1b0603d2ce409b0eb6df9bf859eddc2ee102c25d056fbda', 1, NULL, 'cmilfont', NULL, 'cmilfont@gmail.com')

  def show

    if params[:id]
      @user = User.find_by_login params[:id]
---
SELECT * FROM `users` WHERE (`users`.`login` = 'cmilfont') LIMIT 1

  def update
    @user = current_user # makes our views "cleaner" and more consistent
    @user.attributes = params[:user]
    @user.save do |result|
---
UPDATE `users` SET `updated_at` = '2009-11-02 14:30:44', `last_request_at` = '2009-11-02 14:30:44' WHERE `id` = 1