app/controllers/weight_goals_controller.rb

INSERT INTO `weight_goals` (`goal`, `created_at`, `updated_at`, `weight`, `user_id`) VALUES('2009-12-13 00:00:00', '2009-12-08 19:59:32', '2009-12-08 19:59:32', 89.0, 1)
---
  def create
    @weight_goal = WeightGoal.new(params[:weight_goal])

    respond_to do |format|
      if @weight_goal.save