app/controllers/weights_controller.rb

  def index
    @user_id = params[:user_id] || current_user.id
    @page = params[:page] || 1
    @per_page = params[:limit] || 10
    @weights = Weight.paginate(:conditions => {:user_id => @user_id},
      :page => @page,:per_page => @per_page)
---
SELECT * FROM `weights` WHERE (`weights`.`user_id` = '1') ORDER BY created_at DESC LIMIT 0, 10
SELECT count(*) AS count_all FROM `weights` WHERE (`weights`.`user_id` = 1)

  def show
    @weight = Weight.find(params[:id])
---
SELECT * FROM `weights` WHERE (`weights`.`id` = 84)

  def create
    @weight = Weight.new(params[:weight])

    respond_to do |format|
      if @weight.save
---
INSERT INTO `weights` (`created_at`, `updated_at`, `weight`, `user_id`) VALUES('2009-11-01 15:40:15', '2009-11-01 15:40:15', 96.25, 1)