app/controllers/workouts_controller.rb

SELECT * FROM `workouts`
---
  def index
    @workouts = Workout.all

SELECT * FROM `workouts` WHERE (`workouts`.`id` = 1)
---
  def show
    @workout = Workout.find(params[:id])

SELECT * FROM `users` WHERE (`users`.`persistence_token` = '38804c6b73bdadcca2864206c6c307e7471006deb9098696f8f0110d0132c1c12028bb3feaa7f203532505c828add7f46b1a388b1f2b68cb45fe2a3bc2c1cebc') LIMIT 1
INSERT INTO `workouts` (`created_at`, `updated_at`, `user_id`) VALUES('2009-10-31 04:58:08', '2009-10-31 04:58:08', 1)
---
  def create
    @workout = Workout.new(params[:workout])
    @workout.user = current_user if current_user
    @user_rest = User.find_by_persistence_token params[:persistence_token]
    @workout.user = @user_rest if @user_rest

    respond_to do |format|
      if @workout.save